# Imports

In [1]:
import numpy as np
import pandas as pd
from matplotlib.patches import Patch
from matplotlib import pyplot as plt
import datetime
from scipy import optimize
import os
import geopandas as gpd
from geopandas import GeoSeries
%matplotlib inline

# Setting areas to pipeline definition

In [2]:
areas = pd.read_csv('../Data/division_choice/20/taz2area.csv')

In [8]:
areas.columns = ['taz_id', 'cell_name']

In [6]:
cell2name = pd.read_excel('../Data/division_choice/20/cell2name.xlsx')

In [7]:
cell2name

          cell_id           cell_name
0              11  Jerusalem and sub.
1   11_betshemesh         Bet Shemesh
2              21               Zefat
3              22            Kinneret
4              23      Jezreel Valley
5              24                Akko
6              29       Ramat Hagolan
7              31               Haifa
8              32              Hadera
9              41              Sharon
10             42         Petah Tiqwa
11             43               Ramla
12             44             Rehovot
13             51     Tel Aviv - Yafo
14         51_tlv         TLV suburbs
15          51_bb           Bnei Brak
16             61            Ashqelon
17             62   Beer Sheva Jewish
18        62_arab    Beer Sheva Arabs
19             71   Judea and Samaria

In [10]:
areas = areas.merge(cell2name, on='cell_name')

In [13]:
areas.drop(['cell_name'], axis=1, inplace=True)

In [18]:
areas = areas.append(pd.DataFrame({
    'taz_id': range(1,4),
    'cell_id': ['51']*3
}))

In [19]:
areas

      taz_id  cell_id
0          4       51
1          5       51
2          6       51
3          7       51
4          8       51
...      ...      ...
2625    2627  62_arab
2626    2628  62_arab
0          1       51
1          2       51
2          3       51

[2630 rows x 2 columns]

In [20]:
areas.reset_index(inplace=True)
areas.drop(['index'], axis=1, inplace=True)
areas

      taz_id  cell_id
0          4       51
1          5       51
2          6       51
3          7       51
4          8       51
...      ...      ...
2625    2627  62_arab
2626    2628  62_arab
2627       1       51
2628       2       51
2629       3       51

[2630 rows x 2 columns]

In [21]:
areas.sort_values(by='taz_id', inplace=True)

In [25]:
areas.set_index('taz_id', inplace=True)
areas['cell_id'] = areas['cell_id'].astype(str)

In [26]:
areas.to_excel('../Data/division_choice/20/taz2cell.xlsx')